# StructuralConnectionCodeCheckingStatus Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralConnectionCodeCheckingStatus Property
ParameterTypeId Class See Also
---
"Code Checking Status"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralConnectionCodeCheckingStatus { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionCodeCheckingStatus As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralConnectionCodeCheckingStatus {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace